artillery-tests/reports/end-to-end-moderate-west-us.txt
http.codes.200: ................................................................ 1620
http.codes.201: ................................................................ 720
http.codes.204: ................................................................ 360
http.downloaded_bytes: ......................................................... 137633
http.request_rate: ............................................................. 42/sec
http.requests: ................................................................. 2700
http.response_time:
  min: ......................................................................... 598
  max: ......................................................................... 2711
  median: ...................................................................... 1465.9
  p95: ......................................................................... 1939.5
  p99: ......................................................................... 2143.5
http.responses: ................................................................ 2700
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 180
plugins.metrics-by-endpoint.DELETE /house/:houseID/question/:questionID.code...  180
plugins.metrics-by-endpoint.DELETE /house/:houseID/rental/:rentalID.codes.204: . 180
plugins.metrics-by-endpoint.DELETE /user/:userID.codes.200: .................... 180
plugins.metrics-by-endpoint.GET /house/:houseID.codes.200: ..................... 180
plugins.metrics-by-endpoint.GET /house/:houseID/question/:questionID.codes.200:  180
plugins.metrics-by-endpoint.GET /user/:userID.codes.200: ....................... 180
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 180
plugins.metrics-by-endpoint.POST /house/:houseID/question.codes.201: ........... 180
plugins.metrics-by-endpoint.POST /house/:houseID/rental/:rentalID.codes.201: ... 180
plugins.metrics-by-endpoint.POST /user.codes.201: .............................. 180
plugins.metrics-by-endpoint.POST /user/auth.codes.200: ......................... 180
plugins.metrics-by-endpoint.PUT /house.codes.200: .............................. 180
plugins.metrics-by-endpoint.PUT /house/:houseID/rental/:rentalID.codes.200: .... 180
plugins.metrics-by-endpoint.PUT /user/:userID.codes.200: ....................... 180
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 1454
  max: ......................................................................... 2061
  median: ...................................................................... 1465.9
  p95: ......................................................................... 1525.7
  p99: ......................................................................... 1525.7
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID/question/:questionID:
  min: ......................................................................... 1453
  max: ......................................................................... 2230
  median: ...................................................................... 1465.9
  p95: ......................................................................... 1525.7
  p99: ......................................................................... 2059.5
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID/rental/:rentalID:
  min: ......................................................................... 1452
  max: ......................................................................... 2123
  median: ...................................................................... 1465.9
  p95: ......................................................................... 1525.7
  p99: ......................................................................... 1863.5
plugins.metrics-by-endpoint.response_time.DELETE /user/:userID:
  min: ......................................................................... 1466
  max: ......................................................................... 2091
  median: ...................................................................... 1495.5
  p95: ......................................................................... 1556.5
  p99: ......................................................................... 1686.1
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 599
  max: ......................................................................... 1301
  median: ...................................................................... 608
  p95: ......................................................................... 632.8
  p99: ......................................................................... 788.5
plugins.metrics-by-endpoint.response_time.GET /house/:houseID/question/:questionID:
  min: ......................................................................... 599
  max: ......................................................................... 1215
  median: ...................................................................... 608
  p95: ......................................................................... 632.8
  p99: ......................................................................... 685.5
plugins.metrics-by-endpoint.response_time.GET /user/:userID:
  min: ......................................................................... 598
  max: ......................................................................... 1227
  median: ...................................................................... 608
  p95: ......................................................................... 645.6
  p99: ......................................................................... 804.5
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 1031
  max: ......................................................................... 1681
  median: ...................................................................... 1043.3
  p95: ......................................................................... 1153.1
  p99: ......................................................................... 1652.8
plugins.metrics-by-endpoint.response_time.POST /house/:houseID/question:
  min: ......................................................................... 1453
  max: ......................................................................... 2095
  median: ...................................................................... 1465.9
  p95: ......................................................................... 1525.7
  p99: ......................................................................... 2059.5
plugins.metrics-by-endpoint.response_time.POST /house/:houseID/rental/:rentalID:
  min: ......................................................................... 1883
  max: ......................................................................... 2701
  median: ...................................................................... 1939.5
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2515.5
plugins.metrics-by-endpoint.response_time.POST /user:
  min: ......................................................................... 1038
  max: ......................................................................... 2310
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1300.1
  p99: ......................................................................... 1686.1
plugins.metrics-by-endpoint.response_time.POST /user/auth:
  min: ......................................................................... 1462
  max: ......................................................................... 2683
  median: ...................................................................... 1495.5
  p95: ......................................................................... 2101.1
  p99: ......................................................................... 2322.1
plugins.metrics-by-endpoint.response_time.PUT /house:
  min: ......................................................................... 1881
  max: ......................................................................... 2683
  median: ...................................................................... 1901.1
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2515.5
plugins.metrics-by-endpoint.response_time.PUT /house/:houseID/rental/:rentalID:
  min: ......................................................................... 1455
  max: ......................................................................... 2293
  median: ...................................................................... 1465.9
  p95: ......................................................................... 1556.5
  p99: ......................................................................... 2143.5
plugins.metrics-by-endpoint.response_time.PUT /user/:userID:
  min: ......................................................................... 1459
  max: ......................................................................... 2711
  median: ...................................................................... 1495.5
  p95: ......................................................................... 1720.2
  p99: ......................................................................... 2101.1
vusers.completed: .............................................................. 180
vusers.created: ................................................................ 180
vusers.created_by_name.End to end: ............................................. 180
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 19964
  max: ......................................................................... 22836.8
  median: ...................................................................... 20136.3
  p95: ......................................................................... 21813.5
  p99: ......................................................................... 22254.1