artillery-tests/reports/house-caching-1get.txt
--------------------------------
Summary report @ 15:07:23(+0000)
--------------------------------

http.codes.201: ................................................................ 130
http.codes.202: ................................................................ 130
http.codes.204: ................................................................ 130
http.downloaded_bytes: ......................................................... 28730
http.request_rate: ............................................................. 13/sec
http.requests: ................................................................. 390
http.response_time:
  min: ......................................................................... 46
  max: ......................................................................... 1472
  median: ...................................................................... 130.3
  p95: ......................................................................... 804.5
  p99: ......................................................................... 1274.3
http.responses: ................................................................ 390
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 130
plugins.metrics-by-endpoint.GET /house/:houseID.codes.202: ..................... 130
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 130
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 46
  max: ......................................................................... 1276
  median: ...................................................................... 125.2
  p95: ......................................................................... 658.6
  p99: ......................................................................... 1274.3
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 57
  max: ......................................................................... 1472
  median: ...................................................................... 135.7
  p95: ......................................................................... 804.5
  p99: ......................................................................... 1022.7
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 58
  max: ......................................................................... 1453
  median: ...................................................................... 130.3
  p95: ......................................................................... 907
  p99: ......................................................................... 1064.4
vusers.completed: .............................................................. 130
vusers.created: ................................................................ 130
vusers.created_by_name.House Flow: ............................................. 130
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 417.4
  max: ......................................................................... 3179.9
  median: ...................................................................... 772.9
  p95: ......................................................................... 2671
  p99: ......................................................................... 2836.2